#[macro_use]
use phf::{phf_map, Map};

pub static ACCUTE_MAP: Map<char, char> = phf_map! {
    'a' => 'á',
    'â' => 'ấ',
    'ă' => 'ắ',
    'e' => 'é',
    'ê' => 'ế',
    'i' => 'í',
    'o' => 'ó',
    'ô' => 'ố',
    'ơ' => 'ớ',
    'u' => 'ú',
    'ư' => 'ứ',
    'y' => 'ý',
    // uppercase
    'A' => 'Á',
    'Â' => 'Ấ',
    'Ă' => 'Ắ',
    'E' => 'É',
    'Ê' => 'Ế',
    'I' => 'Í',
    'O' => 'Ó',
    'Ô' => 'Ố',
    'Ơ' => 'Ớ',
    'U' => 'Ú',
    'Ư' => 'Ứ',
    'Y' => 'Ý',
};

pub static GRAVE_MAP: Map<char, char> = phf_map! {
    'a' => 'à',
    'â' => 'ầ',
    'ă' => 'ằ',
    'e' => 'è',
    'ê' => 'ề',
    'i' => 'ì',
    'o' => 'ò',
    'ô' => 'ồ',
    'ơ' => 'ờ',
    'u' => 'ù',
    'ư' => 'ừ',
    'y' => 'ỳ',
    // uppercase
    'A' => 'À',
    'Â' => 'Ầ',
    'Ă' => 'Ằ',
    'E' => 'È',
    'Ê' => 'Ề',
    'I' => 'Ì',
    'O' => 'Ò',
    'Ô' => 'Ồ',
    'Ơ' => 'Ờ',
    'U' => 'Ù',
    'Ư' => 'Ừ',
    'Y' => 'Ỳ',
};

pub static HOOK_ABOVE_MAP: Map<char, char> = phf_map! {
    'a' => 'ả',
    'â' => 'ẩ',
    'ă' => 'ẳ',
    'e' => 'ẻ',
    'ê' => 'ể',
    'i' => 'ỉ',
    'o' => 'ỏ',
    'ô' => 'ổ',
    'ơ' => 'ở',
    'u' => 'ủ',
    'ư' => 'ử',
    'y' => 'ỷ',
    // uppercase
    'A' => 'Ả',
    'Ă' => 'Ẳ',
    'Â' => 'Ẩ',
    'E' => 'Ẻ',
    'Ê' => 'Ể',
    'O' => 'Ỏ',
    'Ô' => 'Ổ',
    'Ơ' => 'Ở',
    'I' => 'Ỉ',
    'U' => 'Ủ',
    'Ư' => 'Ử',
    'Y' => 'Ỷ',
};

pub static TILDE_MAP: Map<char, char> = phf_map! {
    'a' => 'ã',
    'ă' => 'ẵ',
    'â' => 'ẫ',
    'e' => 'ẽ',
    'ê' => 'ễ',
    'o' => 'õ',
    'ô' => 'ỗ',
    'ơ' => 'ỡ',
    'i' => 'ĩ',
    'u' => 'ũ',
    'ư' => 'ữ',
    'y' => 'ỹ',
    // uppercase
    'A' => 'Ã',
    'Ă' => 'Ẵ',
    'Â' => 'Ẫ',
    'E' => 'Ẽ',
    'Ê' => 'Ễ',
    'O' => 'Õ',
    'Ô' => 'Ỗ',
    'Ơ' => 'Ỡ',
    'I' => 'Ĩ',
    'U' => 'Ũ',
    'Ư' => 'Ữ',
    'Y' => 'Ỹ', 
};

pub static DOT_MAP: Map<char, char> = phf_map! {
    'a' => 'ạ',
    'ă' => 'ặ',
    'â' => 'ậ',
    'e' => 'ẹ',
    'ê' => 'ệ',
    'o' => 'ọ',
    'ô' => 'ộ',
    'ơ' => 'ợ',
    'i' => 'ị',
    'u' => 'ụ',
    'ư' => 'ự',
    'y' => 'ỵ',
    // uppercase
    'A' => 'Ạ',
    'Ă' => 'Ặ',
    'Â' => 'Ậ',
    'E' => 'Ẹ',
    'Ê' => 'Ệ',
    'O' => 'Ọ',
    'Ô' => 'Ộ',
    'Ơ' => 'Ợ',
    'I' => 'Ị',
    'U' => 'Ụ',
    'Ư' => 'Ự',
    'Y' => 'Ỵ',
};      

pub static CIRCUMFLEX_MAP: Map<char, char> = phf_map! {
    'a' => 'â',
    'e' => 'ê',
    'o' => 'ô',
    'A' => 'Â',
    'E' => 'Ê',
    'O' => 'Ô',
};

pub static DYET_MAP: Map<char, char> = phf_map! {
    'd' => 'đ',
    'D' => 'Đ',
};

pub static HORN_MAP: Map<char, char> = phf_map! {
    'u' => 'ư',
    'o' => 'ơ',
    'U' => 'Ư',
    'O' => 'Ơ'
};

pub static BREVE_MAP: Map<char, char> = phf_map! {
    'a' => 'ă',
    'A' => 'Ă',
};
